\chapter{Beschreibung der verschiedenen Messungen und Ergebnisdarstellung}

\section{Teil 1}


\subsection{Konfiguration der Hosts}\label{hostconfig}
Die Hosts werden nach den Vorgaben in \ref{config1} konfiguriert. Host 1 wird an
den Port Fa0/11 angeschlossen, Host 2 an Fa0/18. Host 3 wird nicht
verbunden.\footnote{siehe Versuchsanleitung}

\subsection{Konfiguration des Router}\label{routerconfig}
Der Router wird an den Port Fa0/5 des Switches angeschlossen und konfiguriert.
Die Konfiguration beinhaltet die Änderung des Hostnames in ``CustomerRouter'',
die Konfiguration und Aktivierung der Passwörter und die Konfiguration der
Fa0/1-Schnittstelle:
\begin{lstlisting}
CustomerRouter(config-if)#ip address 192.168.1.1 255.255.255.0
CustomerRouter(config-if)#line console 0
CustomerRouter(config-line)#password cisco
CustomerRouter(config-line)#login
CustomerRouter(config-line)#exit
CustomerRouter(config)#line vty 0 4
CustomerRouter(config-line)#password cisco
CustomerRouter(config-line)#login
CustomerRouter(config-line)#exit
CustomerRouter(config)#enable password cisco
CustomerRouter(config)#enable secret class
CustomerRouter(config)#exit
\end{lstlisting}

\subsection{Konfiguration des Switch}
Die Konfiguration des Switches erfolgt analog zu \ref{routerconfig}. Das
Passwort für den Priviledge EXEC Mode lautet ``cisco123''. Das gleiche Passwort
wird auch für die Konsole und für die \acs{VTY}-Ports (Telnet Ports)
verwendet.\footnote{siehe Versuchsanleitung}

\subsubsection{Konfiguration des Management-Interfaces von VLAN1}
Um die Schnittslelle von VLAN 1 zu konfigurieren, wird im Configuration-Mode der
Befehl ``\textit{interface vlan 1}'' genutzt. Dann wird die IP-Adresse und das
Default-Gateway konfiguriert.

\subsubsection{Konfiguration überprüfen}
Zunächst wird durch ``\textit{show running-config}'' die aktuelle Konfiguration
ausgegeben. Nach einer Kontrolle wird die Konfiguration gesichert, durch das
Kopieren der running-config in die startup-config.
\newline
\newline
Um die Verbindung zu testen, werden Ping- und Telnet-Befehle genutzt.
\begin{itemize}
  	\item Pings
  	\begin{itemize}
    	\item Switch -> Router (192.168.1.1)
    	\item Host 1 -> Switch (192.168.1.5)
    \end{itemize}
\end{itemize}
Beides verlief erfolgreich.\footnote{siehe Anhang \ref{ping1}}
\paragraph{Telnet-Session}\mbox{}\\
Zunächst wird von Host 1 eine Telnet-Session zum Switch-Management VLAN 1
eröffnet:

\begin{lstlisting}
PC>telnet 192.168.1.5
Trying 192.168.1.5 ...Open
\end{lstlisting}

Nach Eingabe des zuvor konfigurierten Passworts (cisco123) ist der Zugriff auf
den Switch möglich. Mit \textit{show version} erhält man Informationen über die
Version der Software des Switches.

\begin{lstlisting}
CustomerSwitch>show version
Cisco IOS Software, C2960 Software (C2960-LANBASE-M), Version 12.2(25)FX, RELEASE SOFTWARE (fc1)
Copyright (c) 1986-2005 by Cisco Systems, Inc.
Compiled Wed 12-Oct-05 22:05 by pt_team

[...]
\end{lstlisting}

Auf dem Switch läuft die Cisco IOS Version 12.2(25)FX.
\newline
\newline
Die vollständige Ausgabe ist im Anhang unter \ref{version} zu finden.
\subsection{MAC-Addressen}


\subsection{Geschwindigkeit und Duplex}


\subsection{Reflection}


\clearpage

\section{Teil 2}


\subsection{Theorie}
\subsubsection{Einsatz von Switches}
\subsubsection{VLAN}
\subsubsection{Zuordnung eines Teilnehmers}
\subsubsection{Trunking}
\subsubsection{Spanning Tree Protokoll}

\subsection{Basiskonfiguration}

\subsection{VLAN Konfiguration}
\subsubsection{Erstellen der VLANs}
\subsubsection{Zuweisung von Switchports zu den VLANs}
\subsubsection{Konfiguration überprüfen}

\subsection{Konfigruation des zweiten Switches}%TODO umbenennen

\subsection{Trunk Konfiguration}

\subsection{InterVLAN Routing}
\subsubsection{Konfiguration der Router}

\subsection{Verbindung zwischen Router und Switch einrichten}
\subsubsection{Verbindungen überprüfen}

\subsection{Analyse der Pakete}


