\chapter{Beschreibung der verschiedenen Messungen und Ergebnisdarstellung}

\section{Konfiguration der Router}
Die folgenden Schritte sind bei allen Routern durchzuführen.
\subsection{Basiskonfiguration}
Zunächst ist der Hostname zu R1 zu ändern. Anschließend werden die Passwörter
konfiguriert und ``logging synchronous'' aktiviert.
\begin{lstlisting}
Router>enable
Router#configure terminal
Router(config)# hostname R1
R1(config)#line console 0
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#exit
R1(config)#line vty 0 4
R1(config-line)#password cisco
R1(config-line)#login
R1(config)#enable password cisco
R1(config)#enable secret class
R1(config)#exit
R1(config)#line console 0
R1(config-line)#logging synchronous
\end{lstlisting}
Für die Konsole wird das Passwort ``cisco'', für den Priviledged EXEC Mode
``class'', vergeben. Durch ``logging synchronous'' wird sichergestellt, dass
keine Systemnachrichten die Befehlseingabe unterbrechen.
\newline
Um die Weiterleitung von IPv6-Paketen zu ermöglichen, muss im \acs{CLI} des
Routers das Kommando \textit{ipv6 unicast-routing} ausgeführt werden.
\newline
Router 2 und Router 3 werden äuivalent konfiguriert.

\subsection{Fast-Ethernet-Schnittstelle}\label{FE}
Im Configuration Mode wird die Fast-Ethernet-Schnittstelle 0/0 konfiguriert und
die entsprechende IPv6-Adresse, sowie die Link-Local-Adresse, aus \ref{config1}
zugewiesen:
\begin{lstlisting}
R1(config)#interface FastEthernet 0/0
R1(config-if)#description R1 LAN Default Gateway
R1(config-if)#R1(config-if)# ipv6 address 2001:DB8:1:1::1/64
R1(config-if)# ipv6 address FE80::1 link-local
R1(config-if)#no shutdown
R1(config-if)#exit
R1(config)#exit
\end{lstlisting}
\subsection{Serial-Schnittstelle}
Analog zu \ref{FE} wird die Serial-Schnittstelle 0/0 konfiguriert:
\begin{lstlisting}
R1(config)#interface serial 0/0/0
R1(config-if)#description WAN link to R2
R1(config-if)#ipv6 address 2001:DB8:1:A001::1/64
R1(config-if)#clock rate 64000
R1(config-if)#no shutdown
R1(config-if)#exit
R1(config)#exit
\end{lstlisting}

\section{Konfiguration der Hosts}
Den Hosts wird das jeweilige Default Gateway (Link-Local-Adresse) und die
entsprechende statische IPv6-Adresse gemäß \ref{config1} zugewiesen. 
%TODO erklären?

\section{Überprüfung der Konfiguration}

\subsection{Überprüfung mittels Ping-Befehlen}
Zunächst wird mittels Eingabeaufforderung überprüft, ob die Konfiguration der
Hosts korrekt ist.\footnote{siehe Anhang \ref{ipconfig}}
\newline
Danach werden Ping-Befehle ausgeführt um die Konfiguration zu testen:
\begin{itemize}
  \item PC1 zu R1
  \item PC2 zu R2
  \item PC3 zu R3
\end{itemize}
Die Befehle verlaufen alle erfolgreich.\footnote{siehe Anhang \ref{pingrouter}}

\subsection{IPv6 Einstellungen}
Durch \textit{show ipv6 interface brief} lässt sich der Status der Interfaces
überprüfen:
\begin{lstlisting}
R1#sh ipv6 interface brief
FastEthernet0/0            [up/up]
    FE80::1
    2001:DB8:1:1::1
FastEthernet0/1            [administratively down/down]
Serial0/0/0                [up/up]
    FE80::290:2BFF:FE95:C001
    2001:DB8:1:A001::1
Serial0/0/1                [administratively down/down]
Vlan1                      [administratively down/down]
\end{lstlisting}

Bei der Fast-Ethernet-Schnittstelle 0/0 werden zwei IPv6-Adressen angezeigt.
%TODO Fragen

\begin{lstlisting}
R1>show ipv6 interface
FastEthernet0/0 is up, line protocol is up
  IPv6 is enabled, link-local address is FE80::1
  No Virtual link-local address(es):
  Global unicast address(es):
    2001:DB8:1:1::1, subnet is 2001:DB8:1:1::/64
  Joined group address(es):
    FF02::1
    FF02::2
    FF02::1:FF00:1

  [...]
\end{lstlisting}
%TODO Multicast Group Addresses


\section{Konfiguration von IPv6-Routing}

\subsection{Statische Routen}


\subsection{Default Routen}
